{"unlock": 0, "android": 1, "w.": 2, "frank": 3, "ableson": 4, "charli": 5, "collin": 6, "robi": 7, "sen": 8, "open": 9, "sourc": 10, "mobileunlock": 11, ":": 12, "develop": 13, "'s": 14, "guid": 15, "provid": 16, "concis": 17, ",": 18, "hands-on": 19, "instruct": 20, "oper": 21, "system": 22, "tool": 23, ".": 24, "book": 25, "teach": 26, "import": 27, "architectur": 28, "concept": 29, "straightforward": 30, "write": 31, "style": 32, "build": 33, "practic": 34, "use": 35, "exampl": 36, "throughout": 37, "action": 38, "second": 39, "edit": 40, "javaandroid": 41, "comprehens": 42, "tutori": 43, "take": 44, "far": 45, "beyond": 46, "``": 47, "hello": 48, "''": 49, "fast-pac": 50, "put": 51, "driver": 52, "seat": 53, "learn": 54, "implement": 55, "strategi": 56, "master": 57, "sdk": 58, "webkit": 59, "app": 60, "html": 61, "5": 62, "even": 63, "extend": 64, "replac": 65, "built-in": 66, "featur": 67, "intrigu": 68, "specif": 69, "gojko": 70, "adzic": 71, "softwar": 72, "engin": 73, "flex": 74, "3": 75, "tariq": 76, "ahm": 77, "jon": 78, "hirschi": 79, "faisal": 80, "abid": 81, "internet": 82, "4": 83, "dan": 84, "orlando": 85, "john": 86, "c.": 87, "bland": 88, "ii": 89, "joel": 90, "hook": 91, "collect": 92, "intellig": 93, "satnam": 94, "alag": 95, "zend": 96, "framework": 97, "rob": 98, "allen": 99, "nick": 100, "lo": 101, "steven": 102, "brown": 103, "web": 104, "developmentzend": 105, "show": 106, "creat": 107, "web-bas": 108, "applic": 109, "servic": 110, "over-the-should": 111, "tour": 112, "compon": 113, "high": 114, "qualiti": 115, "real-world": 116, "java": 117, "bernerd": 118, "allmon": 119, "jeremi": 120, "anderson": 121, "beauti": 122, "written": 123, "must": 124, "everi": 125, "ashish": 126, "kulkarni": 127, "technic": 128, "director": 129, "e-busi": 130, "solut": 131, "ltd": 132, "griffon": 133, "andr": 134, "almiray": 135, "danno": 136, "ferrin": 137, "jame": 138, "shingler": 139, "javagriffon": 140, "want": 141, "product": 142, "approach": 143, "ui": 144, "immedi": 145, "dive": 146, "orient": 147, "quick": 148, "groovi": 149, "start": 150, "explor": 151, "swing": 152, "one": 153, "troublesom": 154, "part": 155, "amount": 156, "code": 157, "requir": 158, "get": 159, "simpl": 160, "ground": 161, "osgi": 162, "depth": 163, "alexandr": 164, "de": 165, "castro": 166, "alv": 167, "javaenterpris": 168, "platform": 169, "enterpris": 170, "emerg": 171, "java-bas": 172, "technolog": 173, "modular": 174, "address": 175, "sever": 176, "shortcom": 177, "exist": 178, "allow": 179, "creation": 180, "better": 181, "maintain": 182, "extens": 183, "simpler": 184, "easier-to-us": 185, "light-weight": 186, "flexibl": 187, "rail": 188, "peter": 189, "armstrong": 190, "standard": 191, "hold": 192, "definit": 193, "money": 194, "worth": 195, "!": 196, "internethello": 197, "progress": 198, "26": 199, "self-contain": 200, "select": 201, "vari": 202, "small": 203, "one-pag": 204, "3d": 205, "rotat": 206, "haiku": 207, "connect": 208, "four-lik": 209, "game": 210, "last": 211, "chapter": 212, "full": 213, "call": 214, "socialstalkr": 215, "mashup": 216, "let": 217, "follow": 218, "friend": 219, "tweet": 220, "yahoo": 221, "map": 222, "coffeehous": 223, "levi": 224, "asher": 225, "christian": 226, "crumlish": 227, "miscellaneouscoffeehous": 228, "antholog": 229, "stori": 230, "poem": 231, "essay": 232, "origin": 233, "publish": 234, "world": 235, "wide": 236, "team": 237, "foundat": 238, "server": 239, "2008": 240, "jamil": 241, "azher": 242, "microsoft": 243, ".net": 244, "brownfield": 245, "kyle": 246, "baley": 247, "donald": 248, "belcham": 249, "microsoftbrownfield": 250, "legaci": 251, "state-of-the-art": 252, "pattern": 253, "appli": 254, "new": 255, "project": 256, "techniqu": 257, "best": 258, "need": 259, "make": 260, "recept": 261, "chang": 262, "mongodb": 263, "banker": 264, "next": 265, "generat": 266, "databasesmongodb": 267, "begin": 268, "explain": 269, "uniqu": 270, "describ": 271, "ideal": 272, "case": 273, "seri": 274, "design": 275, "masteri": 276, "lead": 277, "detail": 278, "leverag": 279, "e-commerc": 280, "social": 281, "network": 282, "analyt": 283, "common": 284, "distribut": 285, "powerbuild": 286, "6.0": 287, "michael": 288, "j.": 289, "barlotta": 290, "jaguar": 291, "7": 292, "client-serverjaguar": 293, "onli": 294, "dedic": 295, "prepar": 296, "approv": 297, "sybas": 298, "specialist": 299, "tame": 300, "jason": 301, "r.": 302, "weiss": 303, "user": 304, "interfac": 305, "barrilleaux": 306, "comput": 307, "graphic": 308, "hibern": 309, "bauer": 310, "gavin": 311, "king": 312, "2005": 313, "--": 314, "journal": 315, "(": 316, "chines": 317, ")": 318, "persist": 319, "...": 320, "ultim": 321, "go": 322, "choic": 323, "rush": 324, "store": 325, "javalobbi": 326, "jstl": 327, "shawn": 328, "bayern": 329, "ibati": 330, "clinton": 331, "brandon": 332, "goodin": 333, "larri": 334, "meador": 335, "give": 336, "experienc": 337, "in-depth": 338, "coverag": 339, "advanc": 340, "jeff": 341, "cunningham": 342, "weather": 343, "channel": 344, "interact": 345, "hard": 346, "dougla": 347, "bennett": 348, "object-ori": 349, "program": 350, "well": 351, "author": 352, "doe": 353, "fear": 354, "controversi": 355, "coher": 356, "dr.": 357, "van": 358, "der": 359, "linden": 360, "phillip": 361, "research": 362, "laboratori": 363, "search": 364, "emmanuel": 365, "bernard": 366, "griffin": 367, "great": 368, "resourc": 369, "true": 370, "databas": 371, "independ": 372, "text": 373, "aaron": 374, "walker": 375, "base2servic": 376, "jqueri": 377, "bear": 378, "bibeault": 379, "yehuda": 380, "katz": 381, "best-thought-out": 382, "piec": 383, "literatur": 384, "librari": 385, "forward": 386, "resig": 387, "creator": 388, "javajqueri": 389, "introduct": 390, "javascript": 391, "level": 392, "rewrit": 393, "bestsel": 394, "first": 395, "deep": 396, "latest": 397, "releas": 398, "lab": 399, "page": 400, "anchor": 401, "explan": 402, "travers": 403, "document": 404, "handl": 405, "event": 406, "perform": 407, "anim": 408, "add": 409, "ajax": 410, "also": 411, "plugin": 412, "secur": 413, "reliabl": 414, "kenneth": 415, "p.": 416, "birman": 417, "theori": 418, "tackl": 419, "difficult": 420, "problem": 421, "way": 422, "present": 423, "principl": 424, "proven": 425, "warn": 426, "bnr": 427, "europ": 428, "rubi": 429, "david": 430, "black": 431, "developmentth": 432, "word": 433, "power": 434, "easili": 435, "like": 436, "mean": 437, "tap": 438, "unless": 439, "languag": 440, "well-ground": 441, "rubyist": 442, "programmingwhat": 443, "would": 444, "appear": 445, "complex": 446, "topic": 447, "fact": 448, "surpris": 449, "easi": 450, "assimil": 451, "realiz": 452, "effort": 453, "gradual": 454, "us": 455, "suffici": 456, "knowledg": 457, "order": 458, "without": 459, "pain": 460, "subject": 461, "fruit": 462, "eric": 463, "grimoi": 464, "developpez.com": 465, "websit": 466, "owner": 467, "manual": 468, "paul": 469, "a.": 470, "boag": 471, "internetwebsit": 472, "help": 473, "form": 474, "vision": 475, "site": 476, "process": 477, "agenc": 478, "enough": 479, "background": 480, "inform": 481, "decis": 482, "jargon-fre": 483, "overview": 484, "includ": 485, "access": 486, "usabl": 487, "onlin": 488, "market": 489, "gain": 490, "understand": 491, "idea": 492, "drive": 493, "success": 494, "asp.net": 495, "4.0": 496, "daniel": 497, "bochicchio": 498, "stefano": 499, "mostarda": 500, "marco": 501, "sancti": 502, ".netasp.net": 503, "contain": 504, "real": 505, "well-known": 506, "profession": 507, "sinc": 508, "preview": 509, "python": 510, "anthoni": 511, "brigg": 512, "pythonhello": 513, "fulli": 514, "cover": 515, "block": 516, "gentl": 517, "object": 518, "function": 519, "near": 520, "programm": 521, "know": 522, "pfc": 523, "refer": 524, "richard": 525, "brook": 526, "file": 527, "format": 528, "wayn": 529, "barri": 530, "shepherd": 531, "visual": 532, "margaret": 533, "m.": 534, "burnett": 535, "adel": 536, "goldberg": 537, "ted": 538, "g.": 539, "lewi": 540, "io": 541, "cahil": 542, "mobil": 543, "iphon": 544, "christoph": 545, "shannon": 546, "appelclin": 547, "anoth": 548, "titl": 549, "roof": 550, "thus": 551, "well-round": 552, "educ": 553, "vladimir": 554, "pasman": 555, "cocoacast.com": 556, "silverlight": 557, "2": 558, "chad": 559, "campbel": 560, "stockton": 561, "solid": 562, "well-thought": 563, "ria": 564, "lot": 565, "ever": 566, "becom": 567, "cloudi": 568, "golo": 569, "roden": 570, "trainer": 571, "speaker": 572, "naomi": 573, "ceder": 574, "pythonthi": 575, "revis": 576, "man": 577, "popular": 578, "offer": 579, "clear": 580, "crisp": 581, "eleg": 582, "famous": 583, "easy-to-read": 584, "syntax": 585, "updat": 586, "introduc": 587, "intranet": 588, "6": 589, "tom": 590, "cervenka": 591, "method": 592, "year": 593, "2000": 594, "robert": 595, "chapman": 596, "businesspract": 597, "step-by-step": 598, "methodolog": 599, "agent": 600, "william": 601, "cockayn": 602, "zyda": 603, "internetmobil": 604, "reader": 605, "abil": 606, "spring": 607, "dynam": 608, "modul": 609, "arnaud": 610, "cogoluegn": 611, "thierri": 612, "templier": 613, "andi": 614, "piper": 615, "javaspr": 616, "dm": 617, "ee": 618, "architect": 619, "fundament": 620, "osgi-bas": 621, "familiar": 622, "engag": 623, "stabl": 624, "emb": 625, "insid": 626, "bundl": 627, "blend": 628, "strength": 629, "depend": 630, "inject": 631, "along": 632, "see": 633, "data": 634, "unit": 635, "test": 636, "configur": 637, "environ": 638, "sql": 639, "administr": 640, "rod": 641, "colledg": 642, "d.": 643, "galpin": 644, "matthia": 645, "kaeppler": 646, "technologyandroid": 647, "treasur": 648, "trove": 649, "good": 650, "100": 651, "ready-to-us": 652, "complet": 653, "end-to-end": 654, "tip": 655, "trickiest": 656, "question": 657, "rais": 658, "forum": 659, "mail": 660, "list": 661, "easy-to-follow": 662, "problem/solution/discuss": 663, "draw": 664, "instrument": 665, "deploy": 666, "altern": 667, "nativ": 668, "perl": 669, "damian": 670, "conway": 671, "p": 672, "gwt": 673, "cooper": 674, "charl": 675, "dave": 676, "crane": 677, "pascarello": 678, "darren": 679, "xml": 680, "jord": 681, "sonneveld": 682, "goddard": 683, "chris": 684, "gray": 685, "ram": 686, "venkataraman": 687, "joe": 688, "prototyp": 689, "scriptacul": 690, "lock": 691, "pojo": 692, "richardson": 693, "read": 694, "battle-weari": 695, "ejb": 696, "avoid": 697, "sin": 698, "father": 699, "lightweight": 700, "c": 701, "#": 702, "online.net": 703, "mung": 704, "cross": 705, "html5": 706, "&": 707, "css3": 708, "crowther": 709, "internetquick": 710, "fast": 711, "example-ori": 712, "css": 713, "review": 714, "basic": 715, "turn": 716, "element": 717, "attribut": 718, "api": 719, "valid": 720, "canva": 721, "drag": 722, "drop": 723, "geoloc": 724, "offlin": 725, "discov": 726, "video": 727, "audio": 728, "plug-in": 729, "vector": 730, "svg": 731, "seam": 732, "javaseam": 733, "goe": 734, "reduc": 735, "burden": 736, "integr": 737, "differ": 738, "jsf": 739, "focus": 740, "core": 741, "busi": 742, "hand": 743, "shobana": 744, "jayaraman": 745, "digit": 746, "infrastructur": 747, "analyst": 748, "univers": 749, "texa": 750, "southwestern": 751, "medic": 752, "center": 753, "tech": 754, "static": 755, "wicket": 756, "martijn": 757, "dashorst": 758, "eelco": 759, "hillenius": 760, "soa": 761, "davi": 762, "strut": 763, "scott": 764, "stanlick": 765, "essenti": 766, "peoplesoft": 767, "custom": 768, "toni": 769, "delia": 770, "galina": 771, "landr": 772, "isidor": 773, "rivera": 774, "prakash": 775, "sankaran": 776, "client-serv": 777, "multithread": 778, "alan": 779, "denni": 780, "scwcd": 781, "exam": 782, "studi": 783, "kit": 784, "hanum": 785, "deshmukh": 786, "jignesh": 787, "malavia": 788, "matthew": 789, "scarpino": 790, "roo": 791, "ken": 792, "rimpl": 793, "srini": 794, "penchikala": 795, "govern": 796, "jos": 797, "dirksen": 798, "rss": 799, "atom": 800, "johnson": 801, "ldap": 802, "manag": 803, "clayton": 804, "donley": 805, "mule": 806, "dossot": 807, "d'emic": 808, "class": 809, "stephen": 810, "drye": 811, "wake": 812, "model": 813, "vikram": 814, "goyal": 815, "command-lin": 816, "cli": 817, "chain": 818, "work": 819, "log": 820, "discoveri": 821, "upload": 822, "fileupload": 823, "protocol": 824, "net": 825, "pars": 826, "digest": 827, "jxpath": 828, "betwixt": 829, "enhanc": 830, "beanutil": 831, "lang": 832, "pool": 833, "dbcp": 834, "tkinter": 835, "e.": 836, "grayson": 837, "microsoft.net": 838, "fergal": 839, "grime": 840, "grail": 841, "glen": 842, "smith": 843, "ledbrook": 844, "javagrail": 845, "domain": 846, "control": 847, "view": 848, "fun": 849, "twitter-styl": 850, "ajax/json": 851, "wizard": 852, "messag": 853, "jabber": 854, "load": 855, "shine": 856, "speed": 857, "gutz": 858, "javanow": 859, "track": 860, "1.2": 861, "addit": 862, "illustr": 863, "s.": 864, "hall": 865, "karl": 866, "stuart": 867, "mcculloch": 868, "savag": 869, "internetosgi": 870, "two": 871, "primari": 872, "goal": 873, "relev": 874, "central": 875, "lifecycl": 876, "promot": 877, "service-ori": 878, "among": 879, "hanson": 880, "adam": 881, "taci": 882, "daryl": 883, "harm": 884, "mcdonald": 885, "sharepoint": 886, "2010": 887, "yvonn": 888, "harryman": 889, ".netsharepoint": 890, "assum": 891, "alreadi": 892, "instal": 893, "look": 894, "solv": 895, "face": 896, "day": 897, "organ": 898, "determin": 899, "type": 900, "offic": 901, "moss": 902, "window": 903, "wss": 904, "fabul": 905, "40": 906, "templat": 907, "dispos": 908, "onc": 909, "lay": 910, "land": 911, "leav": 912, "ant": 913, "erik": 914, "hatcher": 915, "steve": 916, "loughran": 917, "internetth": 918, "cross-platform": 919, "scale": 920, "person": 921, "larg": 922, "multi-team": 923, "j2ee": 924, "lucen": 925, "oti": 926, "gospodnet": 927, "mccandless": 928, "sourcewith": 929, "reusabl": 930, "unmatch": 931, "advic": 932, "still": 933, "answer": 934, "tim": 935, "hatton": 936, "powerbuilderif": 937, "'d": 938, "skill": 939, "section": 940, "ask": 941, "easy-to-understand": 942, "convers": 943, "manner": 944, "decreas": 945, "overal": 946, "code-writ": 947, "time": 948, "awesom": 949, "powerj": 950, "javath": 951, "veri": 952, "n't": 953, "liber": 954, "figur": 955, "snippet": 956, "effect": 957, "applet": 958, "power++": 959, "powerbuilderth": 960, "intermedi": 961, "littl": 962, "c++": 963, "construct": 964, "purpos": 965, "expert": 966, "end": 967, "azur": 968, "hay": 969, "brian": 970, "h.": 971, "princ": 972, ".netazur": 973, "intend": 974, "cloud": 975, "walk": 976, "agil": 977, "vika": 978, "hazrati": 979, "balaji": 980, "loganathan": 981, "engineeringdistribut": 982, "direct": 983, "task": 984, "rather": 985, "rehash": 986, "suppli": 987, "step": 988, "adopt": 989, "embrac": 990, "distil": 991, "care": 992, "aid": 993, "three": 994, "critic": 995, "development-peopl": 996, "metaprogram": 997, "kevin": 998, "hazzard": 999, "bock": 1000, "microsoft/.net": 1001, "portlet": 1002, "apach": 1003, "portal": 1004, "stefan": 1005, "hepper": 1006, "fischer": 1007, "stephan": 1008, "hesmer": 1009, "jacob": 1010, "sean": 1011, "taylor": 1012, "javaportlet": 1013, "manuscript": 1014, "avail": 1015, "download": 1016, "jack": 1017, "herrington": 1018, "programmingcod": 1019, "remot": 1020, "procedur": 1021, "logic": 1022, "key": 1023, "http": 1024, "hethmon": 1025, "alm": 1026, "hüttermann": 1027, "engineeringmani": 1028, "fail": 1029, "unnecessarili": 1030, "becaus": 1031, "unclear": 1032, "redund": 1033, "unproduct": 1034, "cost": 1035, "overrun": 1036, "host": 1037, "respons": 1038, "begun": 1039, "tradit": 1040, "improv": 1041, "happier": 1042, "phase": 1043, "effici": 1044, "task-bas": 1045, "align": 1046, "activ": 1047, "result": 1048, "traceabl": 1049, "artifact": 1050, "continu": 1051, "frequent": 1052, "systemat": 1053, "scrum": 1054, "synthes": 1055, "whole": 1056, "scope": 1057, "set": 1058, "defin": 1059, "mani": 1060, "repeat": 1061, "daili": 1062, "accomplish": 1063, "radic": 1064, "fluiditi": 1065, "demonstr": 1066, "bridg": 1067, "merlin": 1068, "hugh": 1069, "shoffner": 1070, "derek": 1071, "hamner": 1072, "n.": 1073, "hust": 1074, "cedric": 1075, "dumoulin": 1076, "georg": 1077, "franciscus": 1078, "winterfeldt": 1079, "camel": 1080, "claus": 1081, "ibsen": 1082, "jonathan": 1083, "anstey": 1084, "javacamel": 1085, "ani": 1086, "kind": 1087, "45+": 1088, "support": 1089, "peopl": 1090, "wrote": 1091, "date": 1092, "insight": 1093, "deepli": 1094, "involv": 1095, "could": 1096, "grant": 1097, "ingersol": 1098, "thoma": 1099, "morton": 1100, "andrew": 1101, "l.": 1102, "farri": 1103, "engineeringtam": 1104, "example-driven": 1105, "unstructur": 1106, "context": 1107, "automat": 1108, "full-text": 1109, "proper": 1110, "name": 1111, "recognit": 1112, "cluster": 1113, "tag": 1114, "extract": 1115, "summar": 1116, "upon": 1117, "built": 1118, "jboss": 1119, "javid": 1120, "jama": 1121, "gnuplot": 1122, "philipp": 1123, "k.": 1124, "janert": 1125, "embed": 1126, "jen": 1127, "simon": 1128, "cozen": 1129, "jocelyn": 1130, "harrington": 1131, "trebitowski": 1132, "technologyio": 1133, "xcode": 1134, "polish": 1135, "commerci": 1136, "run": 1137, "varieti": 1138, "area": 1139, "chat": 1140, "client": 1141, "base": 1142, "confid": 1143, "powershel": 1144, "month": 1145, "lunch": 1146, "jone": 1147, ".netlearn": 1148, "innov": 1149, "taught": 1150, "thousand": 1151, "bring": 1152, "train": 1153, "asid": 1154, "hour": 1155, "lunchtim": 1156, "perfect": 1157, "entir": 1158, "autom": 1159, "faster": 1160, "thought": 1161, "possibl": 1162, "combin": 1163, "in-the-trench": 1164, "experi": 1165, "deliv": 1166, "painless": 1167, "path": 1168, "career-boost": 1169, "futur": 1170, "r": 1171, "i.": 1172, "kabacoff": 1173, "engineeringr": 1174, "compel": 1175, "packag": 1176, "various": 1177, "crash": 1178, "cours": 1179, "statist": 1180, "normal": 1181, "non-norm": 1182, "longitudin": 1183, "surviv": 1184, "multivari": 1185, "mine": 1186, "messi": 1187, "incomplet": 1188, "ramarao": 1189, "kanneganti": 1190, "prasad": 1191, "chodavarapu": 1192, "ryan": 1193, "bigg": 1194, "internetrail": 1195, "thorough": 1196, "ruby-bas": 1197, "merb": 1198, "marcin": 1199, "kawalerowicz": 1200, "craig": 1201, "berntson": 1202, ".netcontinu": 1203, "reimagin": 1204, "consist": 1205, "studio": 1206, "msbuild": 1207, "subvers": 1208, "tfs": 1209, "citi": 1210, "cruisecontrol.net": 1211, "nunit": 1212, "selenium": 1213, "paradis": 1214, "lost": 1215, "keller": 1216, "businessin": 1217, "think": 1218, "countri": 1219, "merril": 1220, "lynch": 1221, "jetblu": 1222, "harrah": 1223, "motorola": 1224, "cut": 1225, "spend": 1226, "competit": 1227, "edg": 1228, "mark": 1229, "bottom": 1230, "line": 1231, "kermit": 1232, "95+": 1233, "columbia": 1234, "miscella": 1235, "laszlo": 1236, "norman": 1237, "klein": 1238, "max": 1239, "carlson": 1240, "glenn": 1241, "macewen": 1242, "dierk": 1243, "koenig": 1244, "glover": 1245, "guillaum": 1246, "laforg": 1247, "skeet": 1248, "könig": 1249, "cédric": 1250, "champeau": 1251, "hamlet": 1252, "d'arci": 1253, "pragt": 1254, "javagroovi": 1255, "thoroughly-revis": 1256, "rang": 1257, "dsl": 1258, "excel": 1259, "timothi": 1260, "korson": 1261, "vijay": 1262, "vaishnavi": 1263, "object-technolog": 1264, "programmingobject": 1265, "guidanc": 1266, "charg": 1267, "shift": 1268, "aim": 1269, "corpor": 1270, "necessari": 1271, "transit": 1272, "driven": 1273, "lass": 1274, "koskela": 1275, "kousen": 1276, "javamak": 1277, "handbook": 1278, "day-to-day": 1279, "advantag": 1280, "realist": 1281, "challeng": 1282, "desktop": 1283, "easier": 1284, "direct3d/directx": 1285, "kovach": 1286, "graphicsth": 1287, "sound": 1288, "joystick": 1289, "input": 1290, "textur": 1291, "shadow": 1292, "collis": 1293, "detect": 1294, "benjamin": 1295, "kovitz": 1296, "nhibern": 1297, "pierr": 1298, "henri": 1299, "kuat": 1300, "tobin": 1301, "harri": 1302, "report": 1303, "teo": 1304, "lachev": 1305, "aspectj": 1306, "ramniva": 1307, "laddad": 1308, "javaaspectj": 1309, "major": 1310, "best-sel": 1311, "aop": 1312, "annotation-bas": 1313, "load-tim": 1314, "weaver": 1315, "crosscut": 1316, "spring-aspectj": 1317, "jdbc": 1318, "jpa": 1319, "mvc": 1320, "encount": 1321, "hadoop": 1322, "chuck": 1323, "lam": 1324, "javahadoop": 1325, "mapreduc": 1326, "obtain": 1327, "copi": 1328, "sqr": 1329, "vlad": 1330, "f": 1331, "amanda": 1332, "laucher": 1333, ".netf": 1334, "-base": 1335, "tuscani": 1336, "sca": 1337, "law": 1338, "combellack": 1339, "raymond": 1340, "feng": 1341, "haleh": 1342, "mahbod": 1343, "nash": 1344, "javatuscani": 1345, "agnost": 1346, "travel": 1347, "scenario": 1348, "bind": 1349, "communic": 1350, "box": 1351, "client/serv": 1352, "yellow": 1353, "compil": 1354, "client-serverthi": 1355, "vendor": 1356, "marketplac": 1357, "200": 1358, "250": 1359, "programmingframework": 1360, "vertic": 1361, "survey": 1362, "excit": 1363, "tapestri": 1364, "howard": 1365, "ship": 1366, "webwork": 1367, "patrick": 1368, "lightbodi": 1369, "carreira": 1370, "macrubi": 1371, "brendan": 1372, "lim": 1373, "jerri": 1374, "cheung": 1375, "mcanal": 1376, "erlang": 1377, "otp": 1378, "martin": 1379, "logan": 1380, "merritt": 1381, "carlsson": 1382, "programmingerlang": 1383, "shared-st": 1384, "concurr": 1385, "parallel": 1386, "multi-thread": 1387, "consider": 1388, "c/c++": 1389, "unlik": 1390, "relat": 1391, "2007": 1392, "catalog": 1393, "brett": 1394, "lonsdal": 1395, "swan": 1396, "example-rich": 1397, "bdc": 1398, "pull": 1399, "togeth": 1400, "right": 1401, "harold": 1402, "lorin": 1403, "engineeringdo": 1404, "issu": 1405, "hardwar": 1406, "structur": 1407, ";": 1408, "illumin": 1409, "encapsul": 1410, "essenc": 1411, "risk": 1412, "assess": 1413, "due": 1414, "dilig": 1415, "adob": 1416, "air": 1417, "joey": 1418, "lott": 1419, "kathryn": 1420, "rotondo": 1421, "sam": 1422, "ahn": 1423, "ashley": 1424, "atkin": 1425, "restlet": 1426, "jerom": 1427, "louvel": 1428, "boileau": 1429, "mougin": 1430, "internetrestlet": 1431, "rest": 1432, "record": 1433, "server-": 1434, "client-sid": 1435, "devic": 1436, "semant": 1437, "particular": 1438, "googl": 1439, "toolkit": 1440, "itext": 1441, "bruno": 1442, "lowagi": 1443, "learnt": 1444, "aw": 1445, "javaitext": 1446, "intern": 1447, "pdf": 1448, "entri": 1449, "astonish": 1450, "thing": 1451, "surfac": 1452, "lower": 1453, "curv": 1454, "though": 1455, "numer": 1456, "secret": 1457, "hidden": 1458, "adapt": 1459, "port": 1460, "itextsharp": 1461, "itext.net": 1462, "power-3d": 1463, "lussier": 1464, "sna": 1465, "tcp/ip": 1466, "theorysna": 1467, "evolv": 1468, "today": 1469, "tomorrow": 1470, "trend": 1471, "lie": 1472, "web-to-sna": 1473, "jeffrey": 1474, "machol": 1475, "javalearn": 1476, "version": 1477, "whi": 1478, "cvs": 1479, "deal": 1480, "minim": 1481, "maher": 1482, "qusay": 1483, "mahmoud": 1484, "glossari": 1485, "acronym": 1486, "gari": 1487, "malkin": 1488, "internetthi": 1489, "term": 1490, "industri": 1491, "javaserv": 1492, "kito": 1493, "mann": 1494, "linq": 1495, "fabric": 1496, "margueri": 1497, "eichert": 1498, "jim": 1499, "wooley": 1500, "bbss": 1501, "internetinternet": 1502, "world-wid": 1503, "valuabl": 1504, "anyon": 1505, "current": 1506, "algorithm": 1507, "haralambo": 1508, "marmani": 1509, "dmitri": 1510, "babenko": 1511, "junit": 1512, "vincent": 1513, "massol": 1514, "tika": 1515, "mattmann": 1516, "jukka": 1517, "zit": 1518, "assaf": 1519, "arkin": 1520, "lotusscript": 1521, "mcginn": 1522, "businessdevelop": 1523, "note": 1524, "domino": 1525, "emphas": 1526, "useabl": 1527, "maximum": 1528, "midi": 1529, "messick": 1530, "plan": 1531, "atm": 1532, "minoli": 1533, "golway": 1534, "norri": 1535, "networkingplan": 1536, "strateg": 1537, "initi": 1538, "schmidt": 1539, "networkingclient/serv": 1540, "appliact": 1541, "discuss": 1542, "transform": 1543, "data-on": 1544, "voic": 1545, "imag": 1546, "multimedia": 1547, "javafx": 1548, "morri": 1549, "entiti": 1550, ".netmicrosoft": 1551, "ado.net": 1552, "behind": 1553, "orm": 1554, "smooth": 1555, "coupl": 1556, "larger": 1557, "unfold": 1558, "inner": 1559, "highlight": 1560, "2.0": 1561, "neimk": 1562, "busoli": 1563, "dotnetslackers.com": 1564, "sass": 1565, "compass": 1566, "wynn": 1567, "netherland": 1568, "nathan": 1569, "weizenbaum": 1570, "eppstein": 1571, "mathi": 1572, "developmentsass": 1573, "stylesheet": 1574, "revolutionari": 1575, "point": 1576, "associ": 1577, "reset": 1578, "move": 1579, "grid": 1580, "owl": 1581, "5.0": 1582, "neward": 1583, "programmingcor": 1584, "capabl": 1585, "deeper": 1586, "behalf": 1587, "programmingadvanc": 1588, "tricki": 1589, "long": 1590, "exhaust": 1591, "find": 1592, "themselv": 1593, "server-bas": 1594, "mvp": 1595, "contribut": 1596, "53": 1597, "mvps": 1598, "nielsen": 1599, "kalen": 1600, "delaney": 1601, "greg": 1602, "low": 1603, "machan": 1604, "randal": 1605, "kimber": 1606, "tripp": 1607, ".netsql": 1608, "five": 1609, "tune": 1610, "optim": 1611, "brilliant": 1612, "queri": 1613, "postgi": 1614, "regina": 1615, "o.": 1616, "obe": 1617, "leo": 1618, "hsu": 1619, "internetpostgi": 1620, "devot": 1621, "spatial": 1622, "vector-bas": 1623, "gis": 1624, "analyz": 1625, "mac": 1626, "os": 1627, "x": 1628, "o'malley": 1629, "unix": 1630, "accur": 1631, "sort": 1632, "morass": 1633, "overload": 1634, "skittish": 1635, "builder": 1636, "forget": 1637, "worri": 1638, "jade": 1639, "tast": 1640, "satisfi": 1641, "osx": 1642, "-": 1643, "kickstartnews.com": 1644, "art": 1645, "roy": 1646, "osherov": 1647, "mahout": 1648, "owen": 1649, "robin": 1650, "anil": 1651, "dun": 1652, "ellen": 1653, "friedman": 1654, "palermo": 1655, "ben": 1656, "scheirman": 1657, "jimmi": 1658, "bogard": 1659, "pragmat": 1660, "mvc-base": 1661, "v.": 1662, "3.5": 1663, "expand": 1664, "expertis": 1665, "hexter": 1666, "hinz": 1667, "high-spe": 1668, "ramp": 1669, "25": 1670, "rout": 1671, "dip": 1672, "sequenc": 1673, "high-valu": 1674, "high-end": 1675, "wo": 1676, "anywher": 1677, "els": 1678, "skinner": 1679, ".netsp.net": 1680, "debu": 1681, "panda": 1682, "reza": 1683, "rahman": 1684, "lane": 1685, "cuprak": 1686, "remijan": 1687, "javabuild": 1688, "3.1": 1689, "head-on": 1690, "sampl": 1691, "real-lif": 1692, "cdi": 1693, "besid": 1694, "b.": 1695, "passin": 1696, "recommend": 1697, "magazin": 1698, "patton": 1699, "bruce": 1700, "payett": 1701, "authorat": 1702, "pedigre": 1703, "writer": 1704, "might": 1705, "well-written": 1706, "well-organ": 1707, "invalu": 1708, "slashdot.org": 1709, "microsoftwindow": 1710, "sell": 1711, "found": 1712, "member": 1713, "co-design": 1714, "princip": 1715, "preserv": 1716, "crystal-clear": 1717, "sysadmin": 1718, "script": 1719, "util": 1720, "rich": 1721, "interest": 1722, "spark": 1723, "imagin": 1724, "batch": 1725, "string": 1726, "com": 1727, "wmi": 1728, "job": 1729, "winform": 1730, "wpf/xaml": 1731, "pete": 1732, ".netsilverlight": 1733, "sophist": 1734, "ad": 1735, "express": 1736, "communiti": 1737, "50": 1738, "%": 1739, "content": 1740, "mind-expand": 1741, "trip": 1742, "media": 1743, "peak": 1744, "heudeck": 1745, "sang": 1746, "shin": 1747, "sun": 1748, "microsystem": 1749, "matt": 1750, "pearson": 1751, "phone": 1752, "binkley-jon": 1753, "massimo": 1754, "perga": 1755, "sync": 1756, "technologywindow": 1757, "wp7": 1758, "xna": 1759, "around": 1760, "zip": 1761, "dial": 1762, "email": 1763, "send": 1764, "nut": 1765, "bolt": 1766, "sensor": 1767, "acceleromet": 1768, "camera": 1769, "touch": 1770, "screen": 1771, "gps": 1772, "microphon": 1773, "locat": 1774, "push": 1775, "notif": 1776, "lift": 1777, "perrett": 1778, "theo": 1779, "petersen": 1780, "toma": 1781, "petricek": 1782, ".netthi": 1783, "prior": 1784, "machin": 1785, "engineeringmachin": 1786, "realiti": 1787, "everyday": 1788, "analysi": 1789, "classif": 1790, "forecast": 1791, "higher-level": 1792, "simplif": 1793, "dhanji": 1794, "prasanna": 1795, "probabl": 1796, "someon": 1797, "neal": 1798, "pulier": 1799, "foreword": 1800, "gaffney": 1801, "qualifi": 1802, "[": 1803, "]": 1804, "general": 1805, "audienc": 1806, "stapl": 1807, "inc.": 1808, "open-sourc": 1809, "esb": 1810, "tij": 1811, "rademak": 1812, "dsls": 1813, "boo": 1814, "domain-specif": 1815, "oren": 1816, "eini": 1817, "ayend": 1818, "rahien": 1819, ".netdsl": 1820, "match": 1821, "execut": 1822, "awkward": 1823, "xml-laden": 1824, "concentr": 1825, "textual": 1826, "recip": 1827, "j": 1828, "rainsberg": 1829, "stirl": 1830, "wxpython": 1831, "noel": 1832, "rappin": 1833, "dunn": 1834, "contemporari": 1835, "materi": 1836, "melissa": 1837, "strang": 1838, "walden": 1839, "www.reviews.com": 1840, "clojur": 1841, "amit": 1842, "rathor": 1843, "javaclojur": 1844, "lisp": 1845, "blow": 1846, "matter": 1847, "unit-test": 1848, "scalabl": 1849, "web-appl": 1850, "hbase": 1851, "rabbitmq": 1852, "scala": 1853, "nilanjan": 1854, "raychaudhuri": 1855, "trygv": 1856, "reenskaug": 1857, "reus": 1858, "come": 1859, "close": 1860, "ralph": 1861, "illinoi": 1862, "php": 1863, "dagfinn": 1864, "reiersøl": 1865, "marcus": 1866, "baker": 1867, "shiflett": 1868, "textbook": 1869, "cal": 1870, "evan": 1871, "podcast": 1872, "ninja": 1873, "signific": 1874, "doherti": 1875, "mozilla": 1876, "ronni": 1877, "businessmicrosoft": 1878, "simpli": 1879, "realli": 1880, "skip": 1881, "esoter": 1882, "99": 1883, "never": 1884, "robinson": 1885, "pavel": 1886, "vorobiev": 1887, "bean": 1888, "lawrenc": 1889, "rodrigu": 1890, "videoconferenc": 1891, "rosen": 1892, "enorm": 1893, "impact": 1894, "quantifi": 1895, "primer": 1896, "achiev": 1897, "gill": 1898, "vice": 1899, "presid": 1900, "group": 1901, "intel": 1902, "ungermann": 1903, "ceo": 1904, "virtual": 1905, "jothi": 1906, "rosenberg": 1907, "arthur": 1908, "mateo": 1909, "ellipt": 1910, "cryptographi": 1911, "rose": 1912, "ieee": 1913, "p1363": 1914, "cryptologia": 1915, "arnon": 1916, "rotem-gal-oz": 1917, "soain": 1918, "technology-neutr": 1919, "anti-pattern": 1920, "warren": 1921, "sand": 1922, "carter": 1923, "scbcd": 1924, "sanghera": 1925, "sarin": 1926, "3.0": 1927, "dwr": 1928, "swt/jface": 1929, "holder": 1930, "stanford": 1931, "ng": 1932, "laurent": 1933, "mihalkov": 1934, "javaguid": 1935, "eclipse-bas": 1936, "gui": 1937, "love": 1938, "pack": 1939, "fluff": 1940, "opencl": 1941, "multiprotocol": 1942, "networkingwith": 1943, "equal": 1944, "seemann": 1945, ".netdepend": 1946, "di": 1947, "selman": 1948, "graph": 1949, "liferay": 1950, "sezov": 1951, "jr": 1952, "jsp": 1953, "gal": 1954, "shachor": 1955, "chace": 1956, "magnus": 1957, "rydin": 1958, "instant": 1959, "iain": 1960, "shigeoka": 1961, "javathi": 1962, "im": 1963, "marq": 1964, "singer": 1965, "murray": 1966, "gambol": 1967, "javajava": 1968, "almost": 1969, "cd": 1970, "appropri": 1971, "siddaway": 1972, ".netpowershel": 1973, "cookbook-styl": 1974, "perspect": 1975, "rapid": 1976, "sens": 1977, "simpson": 1978, "mitchel": 1979, "christeson": 1980, "rehan": 1981, "zaidi": 1982, "levin": 1983, "businessmak": 1984, "benefit": 1985, "potenti": 1986, "limit": 1987, "c++/cli": 1988, "nishant": 1989, "sivakumar": 1990, "outstand": 1991, "must-read": 1992, "ayman": 1993, "shoukri": 1994, "vc++": 1995, ".netc": 1996, "re-hash": 1997, "unchang": 1998, "hit": 1999, "scene": 2000, "decad": 2001, "ago": 2002, "onward": 2003, "magic": 2004, "a-lif": 2005, "avatar": 2006, "distinct": 2007, "clipcode.com": 2008, "sidki": 2009, "classifi": 2010, "rare": 2011, "setup/migr": 2012, "must-hav": 2013, "agilist": 2014, "bedsid": 2015, "accompani": 2016, "migrat": 2017, "siber": 2018, "activemq": 2019, "snyder": 2020, "dejan": 2021, "bosanac": 2022, "javaactivemq": 2023, "tomcat": 2024, "servicemix": 2025, "jms": 2026, "financi": 2027, "earli": 2028, "client-serverimpl": 2029, "aris": 2030, "pitfal": 2031, "entry-level": 2032, "account": 2033, "clerk": 2034, "mis": 2035, "staff": 2036, "sponsor": 2037, "dmvs": 2038, "ian": 2039, "stirk": 2040, "interpret": 2041, "act": 2042, "captur": 2043, "keep": 2044, "top": 2045, "shape": 2046, "dmfs": 2047, "enabl": 2048, "health": 2049, "joshua": 2050, "suereth": 2051, "javascala": 2052, "dozen": 2053, "heavy-hand": 2054, "here-just": 2055, "*": 2056, "sweet": 2057, "spot": 2058, "intersect": 2059, "oo": 2060, "inherit": 2061, "multipl": 2062, "composit": 2063, "employ": 2064, "tail": 2065, "recurs": 2066, "immut": 2067, "monad": 2068, "readabl": 2069, "dig": 2070, "appreci": 2071, "instanc": 2072, "manipul": 2073, "constraint": 2074, "enforc": 2075, "jvm": 2076, "ecosystem": 2077, "rough": 2078, "jmx": 2079, "sullin": 2080, "whippl": 2081, "cookbook": 2082, "averag": 2083, "nov.": 2084, "2003": 2085, "essington": 2086, "anna": 2087, "tökke": 2088, "petar": 2089, "tahchiev": 2090, "felip": 2091, "leme": 2092, "gregori": 2093, "javajunit": 2094, "up-to-d": 2095, "mock": 2096, "isol": 2097, "in-contain": 2098, "bitter": 2099, "tate": 2100, "mike": 2101, "clark": 2102, "bob": 2103, "lee": 2104, "linskey": 2105, "tone": 2106, "refresh": 2107, "ubiquit": 2108, "preachi": 2109, "tome": 2110, "danc": 2111, "often": 2112, "incorrect": 2113, "pothol": 2114, "forc": 2115, "past": 2116, "olivi": 2117, "bazoud": 2118, "jdk": 2119, "1.4": 2120, "travi": 2121, "ipad": 2122, "technologyus": 2123, "much": 2124, "attract": 2125, "bret": 2126, "updegraff": 2127, "ten": 2128, "userfriendly.org": 2129, "jd": 2130, "illiad": 2131, "frazer": 2132, "miscellaneousthi": 2133, "collector": 2134, "volum": 2135, "strip": 2136, "novemb": 2137, "17": 2138, "1997": 2139, "16": 2140, "cartoon": 2141, "annot": 2142, "comment": 2143, "userfriend": 2144, "artist": 2145, "martien": 2146, "verbruggen": 2147, "alvaro": 2148, "videla": 2149, "j.w": 2150, "xdoclet": 2151, "wall": 2152, "breidenbach": 2153, "launch": 2154, "short": 2155, "ongo": 2156, "bulk": 2157, "third": 2158, "reflect": 2159, "willi": 2160, "wheeler": 2161, "white": 2162, "developmentspr": 2163, "diverg": 2164, "befor": 2165, "left": 2166, "feel": 2167, "irrelev": 2168, "micro": 2169, "hemphil": 2170, "workflow": 2171, "phil": 2172, "wicklund": 2173, "simplic": 2174, "visio": 2175, "infopath": 2176, "extern": 2177, "state": 2178, "handler": 2179, "previous": 2180, "wictor": 2181, "wilén": 2182, "countless": 2183, "everyth": 2184, "troubleshoot": 2185, "upgrad": 2186, "scratch": 2187, ".netc++": 2188, "tr2": 2189, "robust": 2190, "servlet": 2191, "williamson": 2192, "vb": 2193, "asp": 2194, "wilson": 2195, "tracey": 2196, "oracle8i": 2197, "yuhanna": 2198, "gabe": 2199, "zichermann": 2200, "incorpor": 2201, "decod": 2202, "tangibl": 2203, "produc": 2204, "whether": 2205, "centerpiec": 2206, "added-valu": 2207, "har": 2208, "holli": 2209, "cummin": 2210, "ward": 2211, "ext": 2212, "js": 2213, "jesus": 2214, "garcia": 2215, "grgur": 2216, "grisogono": 2217, "andresen": 2218, "enriqu": 2219, "ortiz": 2220, "arduino": 2221, "nobl": 2222, "jordan": 2223, "hochenbaumarduino": 2224, "electron": 2225, "suitabl": 2226, "beginn": 2227, "blink": 2228, "led": 2229, "node.j": 2230, "cantelon": 2231, "marc": 2232, "harter": 2233, "t.j.": 2234, "holowaychuk": 2235, "rajlich": 2236, "developmentnode.j": 2237, "squar": 2238, "production-qu": 2239, "node": 2240, "community-cr": 2241, "asynchron": 2242, "lessen": 2243, "bottleneck": 2244, "third-parti": 2245, "vinegar": 2246, "anton": 2247, "kovalyov": 2248, "hodg": 2249, "duan": 2250, "field": 2251, "kolb": 2252, "maria": 2253, "winslow": 2254, "ajamu": 2255, "wesley": 2256, "os/2": 2257, "trask": 2258, "angel": 2259, "roman": 2260, "big": 2261, "marz": 2262, "coffeescript": 2263, "loui": 2264, "davidson": 2265, "brad": 2266, "mcgehe": 2267, "lennon": 2268, "ash": 2269, "blue": 2270, "wanishhtml5": 2271, "aspect": 2272, "live": 2273, "alex": 2274, "holm": 2275, "nichola": 2276, "dimiduk": 2277, "amandeep": 2278, "khurana": 2279, "campo": 2280, "jackson": 2281, "gilman": 2282, "hack": 2283, "carlo": 2284, "sessa": 2285, "jefferi": 2286, "hick": 2287, "augment": 2288, "reveal": 2289, "rice": 2290, "well-structur": 2291, "julio": 2292, "odi": 2293, "link": 2294, "wood": 2295, "marsha": 2296, "zaidman": 2297, "luke": 2298, "ruth": 2299, "victor": 2300, "romero": 2301, "singl": 2302, "mikowski": 2303, "josh": 2304, "powel": 2305, "play": 2306, "nicola": 2307, "leroux": 2308, "siets": 2309, "kaper": 2310, "dart": 2311, "buckett": 2312, "redi": 2313, "josiah": 2314, "ti-83": 2315, "plus/ti-84": 2316, "plus": 2317, "neo4j": 2318, "jona": 2319, "partner": 2320, "aleksa": 2321, "vukot": 2322, "nicki": 2323, "watt": 2324, "chiusano": 2325, "rúnar": 2326, "bjarnason": 2327, "hilton": 2328, "bakker": 2329, "francisco": 2330, "canedo": 2331, "young": 2332, "sonarqub": 2333, "ann": 2334, "patroklo": 2335, "papapetrou": 2336, "xaml": 2337, "helmick": 2338, "mondrian": 2339, "back": 2340, "goodman": 2341, "julian": 2342, "hyde": 2343, "akka": 2344, "roestenburg": 2345, "hain": 2346, "keith": 2347, "b": 2348, "oca": 2349, "se": 2350, "certif": 2351, "mala": 2352, "gupta": 2353, "kanban": 2354, "hammarberg": 2355, "joakim": 2356, "sunden": 2357, "solr": 2358, "trey": 2359, "grainger": 2360, "potter": 2361, "nosql": 2362, "mccreari": 2363, "kelli": 2364, "grove": 2365, "toolmak": 2366, "cmis": 2367, "chemistri": 2368, "florian": 2369, "müller": 2370, "jay": 2371, "pott": 2372, "aka": 2373, "directori": 2374, "fourth": 2375, "mikado": 2376, "ola": 2377, "ellnestam": 2378, "brolund": 2379, "carver": 2380, "dean": 2381, "hume": 2382, "sbt": 2383, "farwel": 2384, "oisin": 2385, "grehan": 2386, "aleksandar": 2387, "nikol": 2388, "gradl": 2389, "muschko": 2390, "scalatra": 2391, "ivan": 2392, "porto": 2393, "carrero": 2394, "ross": 2395, "hrycyszyn": 2396, "olling": 2397, "jare": 2398, "angularj": 2399, "ford": 2400, "luka": 2401, "ruebbelk": 2402, "metric": 2403, "nicolett": 2404, "trelford": 2405, "joy": 2406, "fogus": 2407, "houser": 2408, "cont": 2409, "donel": 2410, "inventor": 2411, "paula": 2412, "beer": 2413, "carl": 2414, "simmon": 2415, "ember.j": 2416, "joachim": 2417, "haagen": 2418, "skeie": 2419, "netti": 2420, "maurer": 2421, "courtney": 2422, "ravendb": 2423, "itamar": 2424, "syn-hershko": 2425, "ocp": 2426, "backbone.j": 2427, "samuel": 2428, "breed": 2429, "cole": 2430, "krumbholz": 2431, "whisenhunt": 2432, "scienc": 2433, "nina": 2434, "zumel": 2435, "mount": 2436, "arcgi": 2437, "rene": 2438, "rubalcava": 2439, "elasticsearch": 2440, "radu": 2441, "gheorgh": 2442, "hinman": 2443, "sccm": 2444, "2012": 2445, "bannan": 2446, "musician": 2447, "ajay": 2448, "kapur": 2449, "perri": 2450, "cook": 2451, "spencer": 2452, "salazar": 2453, "ge": 2454, "wang": 2455, "bdd": 2456, "f.": 2457, "smart": 2458, "8": 2459, "benoit": 2460, "titanium": 2461, "alloy": 2462, "ricardo": 2463, "alcoc": 2464, "giraph": 2465, "claudio": 2466, "martella": 2467, "shaposhnik": 2468, "dionysio": 2469, "logotheti": 2470, "ketelsen": 2471, "st.": 2472, "kennedi": 2473, "thrift": 2474, "randi": 2475, "abernethi": 2476, "grokk": 2477, "aslam": 2478, "khan": 2479, "cor": 2480, "monsur": 2481, "hossain": 2482, "reactiv": 2483, "roland": 2484, "kuhn": 2485, "jami": 2486, "storm": 2487, "pathirana": 2488, "jankowski": 2489, "henrik": 2490, "brink": 2491, "joseph": 2492, "theodor": 2493, "vantol": 2494, "iii": 2495, "bevacqua": 2496, "git": 2497, "mcquaid": 2498, "impala": 2499, "saltzer": 2500, "istvan": 2501, "szegedi": 2502, "raoul-gabriel": 2503, "urma": 2504, "mario": 2505, "fusco": 2506, "mycroft": 2507, "elixir": 2508, "saša": 2509, "juric´": 2510, "bakkum": 2511, "hawkin": 2512, "shaun": 2513, "verch": 2514, "garrett": 2515, "mongo": 2516, "angular": 2517, "aurelio": 2518, "rosa": 2519, "d3.js": 2520, "elijah": 2521, "meek": 2522, "geoprocess": 2523, "garrard": 2524, "barcod": 2525, "oliv": 2526, "drobnik": 2527, "chef": 2528, "dimitri": 2529, "aivalioti": 2530, "oculus": 2531, "rift": 2532, "bradley": 2533, "austin": 2534, "karen": 2535, "bryla": 2536, "benton": 2537, "openstack": 2538, "codi": 2539, "bumgardn": 2540, "probabilist": 2541, "avi": 2542, "pfeffer": 2543, "uniti": 2544, "hock": 2545, "express.j": 2546, "hahn": 2547, "rick": 2548, "umali": 2549, "spas": 2550, "emmit": 2551}